app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Wizrd"], ["room_number", 777], ["created_at", "2020-07-18 02:17:17.351052"], ["updated_at", "2020-07-18 02:17:17.351052"]]
---
    def create
        school_class = SchoolClass.create(school_classes_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 102], ["updated_at", "2020-07-18 02:17:03.065059"], ["id", 1]]
---
    def update
        school_class = SchoolClass.find(params[:id])
        school_class.update(school_classes_params)