app/controllers/students_controller.rb

    def update
        student = Student.find(params[:id])
        student.update(students_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Jefferson"], ["updated_at", "2020-07-18 02:27:06.706462"], ["id", 7]]